# Development Environment Setup with Security Tools

# Essential Command-line Tools
brew "git"              # Version control
brew "wget"             # File downloading
brew "curl"             # Data transfers
brew "zsh"              # Shell
brew "vim"              # Editor
brew "tmux"             # Terminal multiplexer
brew "htop"             # System monitor
brew "tree"             # Directory viewer
brew "jq"               # JSON processor
brew "nvm"              # Node Version Manager

# Development Tools
brew "python"           # Python (latest 3.x version)
brew "miniconda"        # Conda environment manager
tap "dart-lang/dart"    # Dart requires a specific tap
brew "dart"             # Flutter language
brew "flutter"          # Flutter SDK
brew "ffmpeg"           # Video processing
brew "docker"           # Containerization

# AI/ML Libraries and Tools
brew "protobuf"         # Protocol buffers

# Mobile Development Tools
brew "android-platform-tools"  # ADB & fastboot
brew "android-sdk"             # Android SDK (includes sdkmanager)
brew "android-studio"          # IDE for Android

# Browsers
cask "google-chrome"           # Default browser
cask "firefox"                 # Alternative browser
cask "microsoft-edge"          # Alternative browser for testing

# GUI Applications
cask "iterm2"                  # Terminal emulator
cask "visual-studio-code"      # IDE for general development
cask "slack"                   # Team communication
cask "zoom"                    # Video conferencing
cask "postman"                 # API testing

# Testing Tools
brew "k6"                      # Load testing
brew "httpie"                  # User-friendly HTTP client
brew "selenium-server"         # Selenium for browser testing

# Fonts (for better coding experience)
tap "homebrew/cask-fonts"
cask "font-fira-code"          # Coding font with ligatures

