# Development Environment Setup with Security Tools

# Essential Command-line Tools
brew "git"              # Version control
brew "wget"             # File downloading
brew "curl"             # Data transfers
brew "zsh"              # Shell
brew "vim"              # Editor
brew "tmux"             # Terminal multiplexer
brew "htop"             # System monitor
brew "tree"             # Directory viewer
brew "jq"               # JSON processor
brew "nvm"              # Node Version Manager

# Development Tools
brew "python"           # Python (latest 3.x version)
brew install --cask miniconda
brew install dart-sdk
brew install --cask flutter
brew "ffmpeg"           # Video processing
brew "docker"           # Containerization

# AI/ML Libraries and Tools
brew "protobuf"         # Protocol buffers

# Mobile Development Tools
brew install --cask android-platform-tools
brew install --cask android-sdk
brew install --cask android-studio

# Browsers
brew install --cask google-chrome
brew install --cask firefox
cask "microsoft-edge"          # Alternative browser for testing

# GUI Applications
cask "iterm2"                  # Terminal emulator
cask "visual-studio-code"      # IDE for general development
cask "slack"                   # Team communication
cask "zoom"                    # Video conferencing
cask "postman"                 # API testing

# Testing Tools
brew "k6"                      # Load testing
brew "httpie"                  # User-friendly HTTP client
brew "selenium-server"         # Selenium for browser testing

# Fonts (for better coding experience)
brew install --cask font-fira-code

