# Development Environment Setup with Security Tools

# Essential Command-line Tools
brew "git"              # Version control
brew "wget"             # File downloading
brew "curl"             # Data transfers
brew "zsh"              # Shell
brew "vim"              # Editor
brew "tmux"             # Terminal multiplexer
brew "htop"             # System monitor
brew "tree"             # Directory viewer
brew "jq"               # JSON processor
brew "nvm"              # Node Version Manager
brew "telnet"

# Development Tools
cask "docker"
brew "python"           # Python (latest 3.x version)
cask "miniconda"
cask "flutter"
brew "ffmpeg"           # Video processing
cask "syncthing"
cask "bruno"

# AI/ML Libraries and Tools
brew "protobuf"         # Protocol buffers

# Mobile Development Tools
brew "ruby"
brew "cocoapods"
cask "android-platform-tools"
cask "android-sdk"
cask "android-studio"
cask "mongodb-compass"
brew "cocoapods"
brew "fastlane"

# Browsers
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"          # Alternative browser for testing

# GUI Applications
cask "iterm2"                  # Terminal emulator
cask "visual-studio-code"      # IDE for general development
cask "slack"                   # Team communication
cask "zoom"                    # Video conferencing
cask "postman"                 # API testing

# Testing Tools
brew "k6"                      # Load testing
brew "httpie"                  # User-friendly HTTP client
brew "selenium-server"         # Selenium for browser testing

# Fonts (for better coding experience)
cask "font-fira-code"

